// var : 함수 단위 스코프. 변수의 재선언 및 재할당 가능. (전역 변수)
// let : 블록 단위 스코프. 변수의 재선언 불가, 재할당 가능. (지역 변수 ; 값이 변하는 변수)
// const : 블록 단위 스코프. 변수의 재선언 및 재할당 불가. (기본 선언 방식, 상수)

var v = 10; // 변수 선언과 할당
var v = 20;
v++; // v = 21

console.log('v =',v);

let l = 10;
// let 2 - 20; 재선언 불가
l = 20; // 재할당 가능

console.log('l =',l);

const C = 10;
// C = 20; 재선언 및 재할당 불가

console.log('C =',C);

const Carr = [1, 2, 3]; // 배열 (동일 자료형의 집합)

// const Carr = [2, 1, 3]; 재할당 불가

Carr[0] = 9; // 배열 내의 자료 수정 가능

console.log('Carr =',Carr);